Revit 2024 API
Document.IsDefaultFamilyTypeIdValid Method
 Checks whether the family type id is valid for the give family category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public bool IsDefaultFamilyTypeIdValid(
	ElementId familyCategoryId,
	ElementId familyTypeId
)
Visual Basic
Public Function IsDefaultFamilyTypeIdValid ( _
	familyCategoryId As ElementId, _
	familyTypeId As ElementId _
) As Boolean
Visual C++
public:
bool IsDefaultFamilyTypeIdValid(
	ElementId^ familyCategoryId,
	ElementId^ familyTypeId
)
Parameters
familyCategoryId
Type: Autodesk.Revit.DB.ElementId
 The family category id.
familyTypeId
Type: Autodesk.Revit.DB.ElementId
 The default family type id.
Return Value
 True if the family type id is valid for the give family category, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
Document Class
Autodesk.Revit.DB Namespace